{"experiences": 
    [
        {
          "id": 0,
          "date": "April 2022 — Present",
          "position": "Software Engineer II",
          "company": "Isentia",
          "description": "Design, develop, and maintain enterprise-scale web and data processing systems supporting media intelligence platforms across ANZ and SEA regions. Architect and develop Angular applications within a monorepo, powering internal tools for searching, filtering, and analyzing millions of news and online content items daily. Designed and owned high-volume data pipelines responsible for ingesting, normalizing, and processing content from news sites, blogs, and social media platforms. Led performance optimization initiatives, reducing processing time by approximately 40–50% on critical systems handling large-scale datasets. Owned multiple backend services end-to-end, including a Press/Newspaper ingestion pipeline, assuming full responsibility after team transitions. Serve as a technical escalation point, resolving complex production issues and system failures. Review code, mentor junior engineers, and contribute to architectural and technology decisions across a portfolio of ~20 internal applications. Build and deploy cloud-based ingestion and scraping solutions using AWS (Lambda, API Gateway, DynamoDB, SQS, CloudWatch). Collaborate with distributed engineering teams across multiple countries.",
          "skills": [
            "C#",
            "VB.NET",
            ".NET",
            "Angular",
            "TypeScript",
            "JavaScript",
            "Python",
            "AWS Lambda",
            "API Gateway",
            "DynamoDB",
            "SQS",
            "CloudWatch",
            "MS SQL Server",
            "Data Pipelines",
            "System Architecture",
            "Performance Optimization"
          ]
        },
        {
        "id": 1,
        "date": "May 2021 — March 2022",
        "position": "Global IT Digital Application Support Sr. Analyst",
        "company": "Goodyear",
        "description": "Designed and developed enterprise applications using C# and React, supporting digital initiatives in the tire industry. Deployed cloud solutions using Azure App Service and Azure SQL. Collaborated with international stakeholders to deliver reliable, production-ready systems. Developed SharePoint components with JavaScript for internal business tools.",
        "skills": ["JavaScript", "C#", ".NET", "MS SQL Server", "HTML & CSS", "React", "SharePoint", "Azure App Service", "Azure SQL"]
        },
        {
            "id": 2,
            "date": "November 2017 — April 2021",
            "position": "Software Engineer",
            "company": "Infor PSSC, Inc.",
            "description": "Designed and delivered new ERP features from scratch using C#/.NET combined with a proprietary ERP language, addressing complex client-specific requirements not supported by the existing framework. Architected and implemented a country-specific taxation module to support UK HMRC compliance, building custom C#/.NET components, backend modules, and stored procedures to meet regulatory requirements. Extended and customized the company's internal ERP framework to enable faster delivery of complex enterprise features. Collaborated with global teams to design, implement, and deploy scalable ERP functionality across web and in-house applications. Delivered features and production fixes using Agile/Scrum methodologies, ensuring reliability and maintainability of enterprise systems.",
            "skills": ["JavaScript", "C#", "VB.NET", ".NET", "HTML & CSS", "MS SQL Server", "ERP Systems", "Agile/Scrum"]
        },
        {
            "id": 3,
            "date": "June 2017 — November 2017",
            "position": "Senior Software Engineer",
            "company": "SPi Global",
            "description": "Designed and developed a content acquisition web application using PHP (Laravel) with MySQL/PostgreSQL. Built C# console applications to automate content acquisition workflows. Developed web scraping tools using Python (Scrapy).",
            "skills": ["JavaScript", "PHP", "Laravel", "Python", "MySQL", "PostgreSQL", "C#", ".NET", "HTML & CSS", "Scrapy"]
        },
        {
            "id": 4,
            "date": "October 2015 — June 2017",
            "position": "Software Engineer II",
            "company": "Medilink Network Inc.",
            "description": "Designed and developed healthcare web applications using C#/.NET and SQL Server. Conducted root cause analysis and implemented permanent fixes for production issues. Participated in system design using ERDs, flowcharts, and MVC/N-tier architectures. Mentored team members and enforced coding best practices.",
            "skills": ["JavaScript", "C#", "VB.NET", ".NET", "HTML & CSS", "MS SQL Server", "MVC", "N-tier Architecture"]
        }
    ]
}
